<a href="https://colab.research.google.com/github/Miswanto313/Machine_Learning/blob/main/SKLearn_Logistic_Regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Dataset untuk latihan bisa Anda unduh pada [tautan](https://www.kaggle.com/dragonheir/logistic-regression) berikut.

Unggah berkas data pada Colab

Impor library dasar.

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import  StandardScaler

Ubah dataset menjadi dataframe Pandas

In [2]:
df = pd.read_csv('/content/sample_data/Social_Network_Ads.csv')

Selanjutnya gunakan fungsi **head()** pada dataframe untuk melihat sejumlah baris pertama dari dataset

In [3]:
df.head(10)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          0

Pada dataset terdapat kolom ‘**User ID**’. Kolom tersebut merupakan atribut yang tidak penting untuk dipelajari oleh model sehingga perlu dihilangkan. Untuk menghilangkan kolom dari dataframe, gunakan fungsi **drop**.

In [4]:
data = df.drop(columns=['User ID'])

Lihat apakah ada nilai yang kosong pada setiap atribut dengan menggunakan fungsi info()

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

Panggil fungsi **get_dummies()** untuk melakukan proses **One-Hot Encoding** karena label pada dataset kita merupakan data kategorikal

In [6]:
data = pd.get_dummies(data)
data

     Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0     19            19000          0              0            1
1     35            20000          0              0            1
2     26            43000          0              1            0
3     27            57000          0              1            0
4     19            76000          0              0            1
..   ...              ...        ...            ...          ...
395   46            41000          1              1            0
396   51            23000          1              0            1
397   50            20000          1              1            0
398   36            33000          0              0            1
399   49            36000          1              1            0

[400 rows x 5 columns]

Pisahkan antara atribut dan label.

In [9]:
predictions = ['Age', 'EstimatedSalary',	'Gender_Female',	'Gender_Male']
X = data[predictions]
y = data['Purchased']

Bagi data menjadi **train set dan test set** yang dapat dilakukan dengan fungsi **train_test_split** yang disediakan SKLearn

In [10]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.25, random_state = 42)

Buat model dengan membuat sebuah objek **logistic regression**.

In [11]:
from sklearn import linear_model
model = linear_model.LogisticRegression()

Latih model kita dengan train set menggunakan fungsi **fit()**.

In [12]:
model.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

Menguji akurasi model pada test set dengan memanggil fungsi score() pada objek model

In [13]:
model.score(X_test, y_test)

0.63